export const FAQResult = {
  mdx: {
    frontmatter: {
      lists: [
        {
          index: 1,
          category: "교육과정",
          title: "코드스쿼드는 온라인 수업만 진행하나요?",
          content:
            "마스터즈 코스는 온오프라인 공간을 모두 활용해 학습하는 것을 지향합니다.\n하지만 팬데믹 상황이 지속되고 있기에 임시로 모든 과정을 온라인으로 진행하고 있습니다.\n\n거리두기 요건의 변화에 따라 오프라인 공간을 활용할 수 있도록 안내해 드리겠습니다.",
          editDate: "2022-04-21",
        },
        {
          index: 2,
          category: "교육과정",
          title: "기수마다 수업 정원은 몇 명정도 되나요?",
          content:
            "마스터즈 코스의 경우, 각 클래스 당 20~50명입니다.\n클래스별로 인원 차가 있을 수 있으므로 정확한 총원을 안내해 드리기는 어렵습니다.",
          editDate: "2022-04-22",
        },
        {
          index: 3,
          category: "교육과정",
          title: "개발은 처음인데, 저도 수업을 들을 수 있을까요?",
          content:
            "마스터즈 코스는 개발 언어를 조금이라도 배워보신 분을 대상으로 하고 있습니다.\n\n프로그래밍 경험이 전혀 없으시다면 다음과 같은 콘텐츠를 통해 먼저 스스로 학습해보시길 추천해 드립니다.\n코드스쿼드 레벨1 인프런 강의(유료)\n생활코딩(무료)\n\n이 외에도 검색을 통해 무료로 다양한 기초 프로그래밍 학습 콘텐츠들을 찾아보실 수 있습니다.",
          editDate: "2022-04-23",
        },
        {
          index: 4,
          category: "교육과정",
          title: "[마스터즈 코스] 선발 시험의 수준과 합격 기준은 어떻게 되나요?",
          content:
            "마스터즈 코스의 시험 수준은\n어떤 언어로든 배열에서 값을 읽고 원하는 조건으로 비교하는 함수를 작성할 수 있는 정도를 최소 수준으로 봅니다.\n\n프로그래머스 같은 코딩테스트 사이트에서\n가장 쉬운 문제들을 스스로 풀 수 있는지 확인함으로써 스스로 검증해 볼 수 있습니다.\n\n웹 개발 환경 변화에 따라, 그리고 더 나은 교육을 제공하기 위해\n수료생들의 피드백을 통해 마스터즈 코스 교육 방식은 매년 변경되고 있습니다.\n\n마스터즈 코스의 합격 기준은\n기술적인 부분에서 기본적인 프로그래밍이 가능한 수준,\n비기술적인 부분은 ‘6개월 동안 다양한 분들과 함께 협력하고, 포기하지 않고, 주도적이고 도적적으로 학습할 수 있는 분’이신지\n여러가지 방면으로 확인하려고 합니다.\n\n절대 시험 성적만으로 합격과 불합격을 결정하지 않습니다.",
          editDate: "2022-04-24",
        },
        {
          index: 5,
          category: "교육과정",
          title: "[마스터즈 코스] 시험 준비 외에 무엇을 학습하면 좋을까요?",
          content:
            "클래스 공통으로 CS기초 또는 Git/GitHub과 같은 버전 관리 시스템을\n추가로 학습하시면 마스터즈 코스 뿐만 아니라 개발자로서의 성장에 장기적으로 도움이 됩니다.\n\n클래스 별로 과정 시작 전에 지원파트에 맞는 언어를 공부하시는 것이 좋습니다.\n웹 프론트엔드는 ‘JavaScript’를, 웹 백엔드는 ‘Java’를, 모바일 iOS는 ‘Swift’를,\n모바일 Android는 ‘Kotlin’을 학습하시면 좋습니다.\n\n웹 프론트엔드와 웹 백엔드 클래스는 추가로 ‘HTML/CSS’를 학습하시는 것도 좋습니다.",
          editDate: "2022-04-25",
        },
        {
          index: 6,
          category: "결제",
          title: "수강료 결제는 어떻게 하나요?",
          content:
            "마스터즈 코스는 4주 단위로 결제하며, 코드투게더 과정은 일시불로 결제합니다.\n\n결제 방식은 카드결제와 계좌 이체가 있으며, 계좌 이체 시 현금영수증을 발급해드립니다.\n카드 결제시 별도의 무이자 할부 혜택은 없으니 참고부탁드립니다.",
          editDate: "2022-04-26",
        },
        {
          index: 7,
          category: "결제",
          title: "수강료 환급 과정이나 국비 지원이 되나요?",
          content:
            "학원에서 제공하는 수강료 할인 및 환급 과정은 없습니다.\n또한 국비 지원 대상 학원도 아니기 때문에 국비 지원을 받으실 수 없습니다.\n\n하지만 서울시 또는 경기도에서 지원하는 청년수당이나\n취업 수당을 개인적으로 신청하여 받은 사례는 있습니다.",
          editDate: "2022-04-27",
        },
        {
          index: 8,
          category: "취업",
          title: "교육 과정 수료 후, 취업하기까지 얼마나 걸리나요?",
          content:
            "마스터즈 코스의 커리큘럼은 평균 6개월 정도의 기준으로 구성되어 있습니다.\n하지만 개인별 학습 속도가 다르므로 사람마다 마스터즈 코스 과정 수료 기간에 차이가 날 수 있습니다.\n\n취업 시기 또한 개인마다 천차만별입니다. 마스터즈 과정 중에 취업하시는 분도 계시고,\n마스터즈 코스 수료 후 거의 1년이 지나고 취업이 된 분들도 있습니다.\n따라서 수료 후 취업 기간에 대해 확답을 해 드리기 어렵습니다.",
          editDate: "2022-04-28",
        },
        {
          index: 9,
          category: "취업",
          title: "교육 과정 수료 후, 취업 지원 시스템이 있나요?",
          content:
            "마스터즈 과정 수료 후 공식적으로 제공해드리는 취업 지원 시스템은 없습니다.\n\n하지만 희망하는 분들께는 이력서 피드백, 모의 인터뷰를 해 드립니다.\n또한 마스터 및 졸업생의 네트워크 & 추천을 통해 다양한 기업에\n조금 더 유리한 조건으로 입사 지원하실 수도 있고,\n수료 후 학생분들끼리 자연스럽게 네트워킹을 형성하여 구직 정보 공유, 면접 스터디 등을 활용해 취업합니다.\n또한 코드스쿼드와 채용연계를 하고 있는 몇몇 회사들이 있습니다.",
          editDate: "2022-04-29",
        },
        {
          index: 10,
          category: "기타",
          title: "과정 중에 빈자리가 생긴다면 들어갈 수 있나요?",
          content:
            "과정이 시작되고 나면 중간에 빈 자리가 생길 확률이 희박하며,\n혹시 빈자리가 생기더라도 코드스쿼드 과정 특성 상 진도를 맞추기 어려우므로 중간에 합류하는 것은 어렵습니다.",
          editDate: "2022-04-30",
        },
      ],
    },
  },
};
